# SHYFT

**SHYFT** — консольная утилита для фильтрации содержимого входных файлов по типам данных. Программа читает входные файлы, определяет типы элементов (целое, вещественное, строка), фильтрует их и сохраняет в отдельные выходные файлы.

## 🎯 Цель системы

Разделение и фильтрация данных из входных файлов по типам с сохранением в соответствующие выходные файлы и возможностью конфигурации поведения через аргументы командной строки.

## 🔧 Функциональные возможности

Система позволяет:

1. Читать данные из одного или нескольких входных файлов, переданных через аргументы командной строки.
2. Определять тип каждого элемента входных данных
3. Фильтровать данные по типам и распределять их по категориям.
4. Записывать каждый тип данных в отдельный выходной файл.
5. Создавать выходные файлы **только при наличии** данных соответствующего типа.
6. Устанавливать путь и префикс выходных файлов через параметры командной строки.
7. Работать в режиме:
   - **перезаписи** файлов
   - **добавления** в существующие файлы
8. Собирать статистику по каждому типу данных.
9. Выводить статистику и предупреждения в консоль по завершении работы.

## ❗ Не функциональные требования

- Система должна **продолжать выполнение** даже при частичных сбоях, сообщая о них пользователю.
- Код должен быть **чистым и поддерживаемым**.
- Система должна включать **инструкцию по запуску** и использованию.




## 🧑‍💻 Актор: Пользователь (User)

### 📌 Варианты использования (Use Cases)

#### 1. Указать входные файлы
- Пользователь указывает один или несколько файлов для обработки.

#### 2. Настроить параметры вывода
- Указать путь к папке вывода (`-o`).
- Указать префикс выходных файлов (`-p`).
- Установить режим добавления (`-a`).

#### 3. Запустить фильтрацию
- Система читает данные из указанных файлов.
- Определяет типы данных (целые числа, вещественные числа, строки).
- Распределяет данные по соответствующим категориям.
- Записывает данные в выходные файлы (если такие данные есть).
- Собирает статистику (если включена соответствующая опция).

#### 4. Вывести статистику
- Краткая статистика (`-s`).
- Полная статистика (`-f`).